The identifier for the fabrication service.
  Namespace:   Autodesk.Revit.UI.Events
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public int ServiceId { get; }
  Visual Basic
Public ReadOnly Property ServiceId As Integer
	Get
  Visual C++
public:
property int ServiceId {
	int get ();
}
 See Also
  FabricationPartBrowserChangedEventArgs Class
  Autodesk.Revit.UI.Events Namespace